## Terraform Plan

Terraform plan does not include resource deletions. This PR may be merged.

<details>
	<summary>Click here to view the terraform plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.container_image_repository will be created
  + resource "google_artifact_registry_repository" "container_image_repository" {
      + create_time      = (known after apply)
      + description      = "Repository for our roommate-billing-notifier-images"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = (known after apply)
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "roommate-billing-notifier-7816"
      + registry_uri     = (known after apply)
      + repository_id    = "cloud-run-images-dev"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }

      + vulnerability_scanning_config (known after apply)
    }

  # google_firestore_database.default will be created
  + resource "google_firestore_database" "default" {
      + app_engine_integration_mode         = (known after apply)
      + concurrency_mode                    = (known after apply)
      + create_time                         = (known after apply)
      + database_edition                    = "STANDARD"
      + delete_protection_state             = "DELETE_PROTECTION_ENABLED"
      + deletion_policy                     = "ABANDON"
      + earliest_version_time               = (known after apply)
      + etag                                = (known after apply)
      + firestore_data_access_mode          = (known after apply)
      + id                                  = (known after apply)
      + key_prefix                          = (known after apply)
      + location_id                         = "us-south1"
      + mongodb_compatible_data_access_mode = (known after apply)
      + name                                = "billing"
      + point_in_time_recovery_enablement   = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                             = "roommate-billing-notifier-7816"
      + realtime_updates_mode               = (known after apply)
      + type                                = "FIRESTORE_NATIVE"
      + uid                                 = (known after apply)
      + update_time                         = (known after apply)
      + version_retention_period            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>